Revit 2027 API
FamilyInstanceCreationData.RotateAngle Property
 Get or set the rotate angle of the FamilyInstance
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RotateAngle { get; set; }
Public Property RotateAngle As Double
	Get
	Set
public:
property double RotateAngle {
	double get ();
	void set (double value);
}
member RotateAngle : float with get, set
Property Value
Double
Remarks
 The FamilyInstance will rotate this angle when the instance is created.
See Also
Reference
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace